2018-10-03-vm-flags-from-running-jvm.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://www.birkey.co/rss.xml"
      title="RSS feed for https://www.birkey.co/">
<title>VM flags from running JVM</title>
<meta name="author" content="Kasim Tuman">
	     <meta name="referrer" content="no-referrer">
	     <link href= "static/style.css" rel="stylesheet" type="text/css" />
	     <link rel="icon" href="static/favicon.ico">
	     <link rel="apple-touch-icon-precomposed" href="static/birkey_logo.png">
	     <link rel="msapplication-TitleImage" href="static/birkey_logo.png">
	     <link rel="msapplication-TitleColor" href="#0141ff">
	     <link rel="alternate" type="application/rss+xml"  title="RSS Feed for birkey.co" href="/rss.xml"
	     <meta http-equiv="content-type" content="application/xhtml+xml; charset=UTF-8">
	     <meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1"></head>
<body>
<div id="preamble" class="status"><br><center>
    <div style="display: inline-block; vertical-align:middle;">
<a href="https://www.birkey.co/index.html" style="text-decoration: none;"><b>BIRKEY CONSULTING</b><br>
</a><hr/><div style="text-align: justify;display: inline-block; width: 100%;">
<a class="title" href="https://www.birkey.co/resume/resume.html">ABOUT</a> &nbsp;<a class="title" href="https://github.com/oneness">GITHUB</a> &nbsp;<a class="title" href="https://www.birkey.co/rss.xml">RSS</a> &nbsp;<a class="title" href="https://www.birkey.co/archive.html">ARCHIVE</a> &nbsp;<a class="title" href="https://paypal.me/ktuman">DONATE</a></div></div>
</center><br><br>
<div style="margin-bottom: 3ch;text-transform: none;"></div></div>
<div id="content">
<div class="post-date">03 Oct 2018</div><h1 class="post-title"><a href="https://www.birkey.co/2018-10-03-vm-flags-from-running-jvm.html">VM flags from running JVM</a></h1>
<p>
While I was doing some JVM GC analysis recently, I got curious about the vm flags that `java` command uses by default if you do not specify it when starting your JVM.
Reading up JDK docs, I found <b>jcmd</b> is exactly what you need:
</p>
<div class="org-src-container">
<pre class="src src-shell">jcmd
</pre>
</div>
<p>
That will list all jvm instances running on your system beginning with
its pids, which you can pass into <b>jcmd</b> with options to print VM flags like this:
</p>
<div class="org-src-container">
<pre class="src src-shell">jcmd &lt;pid&gt; VM.flags
</pre>
</div>
<p>
There are many options you can use other than `VM.flags`, which you can get a full list by:
</p>
<div class="org-src-container">
<pre class="src src-shell">jcmd &lt;pid&gt; help
</pre>
</div>
<div class="taglist"><a href="https://www.birkey.co/tags.html">Tags</a>: <a href="https://www.birkey.co/tag-jvm.html">jvm</a> </div></div>
<div id="postamble" class="status"><br><center>
	   <div style="display: inline-block; vertical-align:middle;"></div></div>
</body>
</html>
